addons/tr03124/src/jvmTest/resources/xml/soap/Eac2Input.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:paos="urn:liberty:paos:2006-08"
			xmlns:wsa="http://www.w3.org/2005/03/addressing" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<S:Header>
		<paos:PAOS S:mustUnderstand="1" S:actor="http://schemas.xmlsoap.org/soap/actor/next">
			<paos:Version>urn:liberty:2006-08</paos:Version>
			<paos:EndpointReference>
				<paos:Address>http://www.projectliberty.org/2006/01/role/paos</paos:Address>
			</paos:EndpointReference>
		</paos:PAOS>
		<wsa:MessageID>urn:uuid:3f5249c2-c269-44e1-940d-50f3b8158c27</wsa:MessageID>
		<wsa:Action>http://www.bsi.bund.de/ecard/api/1.0/PAOS/GetNextCommand</wsa:Action>
	</S:Header>
	<S:Body>
		<ns2:DIDAuthenticate xmlns="urn:oasis:names:tc:dss:1.0:core:schema"
							 xmlns:ns2="urn:iso:std:iso-iec:24727:tech:schema"
							 xmlns:ns3="http://www.w3.org/2000/09/xmldsig#"
							 xmlns:ns4="urn:oasis:names:tc:SAML:1.0:assertion"
							 xmlns:ns5="urn:oasis:names:tc:SAML:1.0:protocol">
			<ns2:ConnectionHandle>
				<ns2:SlotHandle>340C46B396F7D392F3797E14B669A97F</ns2:SlotHandle>
			</ns2:ConnectionHandle>
			<ns2:DIDName>PIN</ns2:DIDName>
			<ns2:AuthenticationProtocolData xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
											xsi:type="ns2:EAC2InputType" Protocol="urn:oid:1.3.162.15480.3.0.14">
				<ns2:Certificate>
					7F2181E77F4E81A05F290100420E44454356434165494430303130377F494F060A04007F00070202020203864104A6785B4A2E4A68DFDAF59BCAEC96DEA0A0A7D65EB6B1CBB5CEA44AA6B0D563BA0627EA3D6C16EB023B00292574D0ED95301CD8EA51CE27968D5AE9AA2D9730F25F2010444544566549444454523130313437327F4C12060904007F0007030102025305404713FF975F25060205000700095F24060205010000065F374035A4A4CFF415974B0F2C4CBB212E759D3A9D2DB3A3C7032B49E978B2CCA656783991E5090648C68926AF9403855D92AB616B024A27AA1A331E53AAEFB6845EEB
				</ns2:Certificate>
				<ns2:EphemeralPublicKey>
					048C74138C3CFEF38DDE206A5FF4244E79741E20FC21FBDEA1BA508F838729C8474FBF809DDB582347356762AF72E1B7CA925CD49E52140A588FC4E23B238D55A6
				</ns2:EphemeralPublicKey>
				<ns2:Signature>
					84095FC69630B5937FB3C1FF4DE17414214ED48D3A72EFB36EA4076BE1D5DC2F21908566B1A2189662B6E3D5906147AD8469C9B143C60C2D81716B75D0583822
				</ns2:Signature>
			</ns2:AuthenticationProtocolData>
		</ns2:DIDAuthenticate>
	</S:Body>
</S:Envelope>
